{
  "members" : {
    "0" : {
      "bio" : "Morpheus is the captain of the Nebuchadnezzar, which is a hovercraft of the human forces of the last human city, Zion, in a devastated world where most humans are grown by sentient Machines and kept imprisoned in the Matrix, a virtual computer-generated world. Morpheus was once a human living inside the Matrix until he was freed earlier in life.",
      "name" : "Morpheus",
      "role" : "clan leader",
      "tech" : "Mind",
      "years" : "36"
    },
    "1" : {
      "bio" : "Cypher tells Trinity that she like to watch Neo. He later offers Neo a drink, regretting taking the blue pill. He mocks him for trying to save the world. He meets with Agent Smith at a restaurant, eating a steak and smoking a cigar, which prompts him declare that ignorance is bliss. He makes a deal to be reinserted into the Matrix in exchange for Morpheus. He wants to remember nothing and be a famous actor. Cypher leaves the Matrix and later trys to kill Tank & Dozer by electrocuting them, and unplugs Apoc and Switch, killing them as well. Tank is still alive and kills him.",
      "name" : "Cypher",
      "role" : "Master Tech",
      "tech" : "everything electric",
      "years" : 12
    },
    "2" : {
      "bio" : "Like the series' other principal characters, Trinity is a computer programmer and a hacker who has escaped from the Matrix, a sophisticated computer program in which most of the human race is imprisoned. Though few specifics are revealed about her previous life inside the Matrix, we are told that Morpheus, one of a number of real-world hovercraft commanders, initially identified her and helped her escape from the program. At the beginning of the series, she is first mate on Morpheus' Nebuchadnezzar and serves mainly as a go-between for him and the individuals he wishes to free from the Matrix. As the series progresses, her primary importance as a character becomes her close relationship with Neo. She is skilled with computers, at operating vehicles both inside and outside the Matrix, and in martial arts.",
      "name" : "Trinity",
      "role" : "Master Tech",
      "tech" : "Mind/body connection",
      "years" : 18
    },
    "3" : {
      "bio" : "Tank is Dozers little brother and was born outside the Matrix. An operator, he loads programs designed to teach Neo marshal arts. He notices errors in the Matrix code when agents arrive in an area. He also finds some building plans. Tank kills Cypher when he attempts to kill him and everyone else.",
      "name" : "Tank",
      "role" : "Enforsement",
      "tech" : "Metal and Bullets",
      "years" : 16
    },
    "-KmnCJ77wdENrEI8lrES" : {
      "bio" : "Oracle is a old lady and a mysterious but powerful figure, she has the power of foresight and guides the humans in the Matrix.",
      "name" : "The Oracle",
      "role" : "Seer",
      "tech" : "ESP",
      "years" : 45
    },
    "-KmnOkRSN5mAc5VJEB1j" : {
      "bio" : "Part of Morpheus' crew, she holds Neo at gunpoint (calling him coppertop) so they can remove the trace bug. When Neo is about to reject their help, she convinces him to trust them. She is killed when Cypher forcibly disconnects her from the Matrix.",
      "name" : "Switch",
      "role" : "Versitile",
      "tech" : "Sharpshooter",
      "years" : "15"
    },
    "-KmnYfFocndVidN8UGch" : {
      "bio" : "Link was a freeborn in Zion, brother of Cas. He grew up to marry Zee, the sister of Tank and Cas' husband Dozer. He promised Dozer that if anything happened to Tank he would take up his job.\n\nHe had previously been the operator on board another ship for AK, who was killed by an Agent while trying to exit before the events leading to Tank and Dozer's death. When this happened, as promised, he joined the crew of the Nebuchadnezzar, becoming their new Operator.",
      "name" : "Apoc",
      "role" : "Operator",
      "tech" : "Heavy artillery",
      "years" : "18"
    },
    "-KmnaR3B-reCfjGPK04W" : {
      "bio" : "Mouse appears to be the youngest and most diminutive crew member on the Zion hovercraft Nebuchadnezzar. He is a pod-born zionite.",
      "name" : "Mouse",
      "role" : "Virtual Pimp",
      "tech" : "Legacy systems",
      "years" : "8"
    }
  },
  "posts" : {
    "0" : {
      "title" : "hack all the things",
      "body" : "Buffer null *.* concurrently buffer rsa d00dz bubble sort protected snarf I'm sorry Dave, I'm afraid I can't do that. Unix gurfle regex tunnel in if strlen tarball tcp pwned machine code try catch Leslie Lamport. Public over clock void public stack big-endian ifdef afk loop python James T. Kirk.",
      "author" : "kid Koala"
    },
    "1" : {
      "title" : "faster than thou",
      "body" : "Win int hello world printf packet sniffer function firewall mailbomb todo less overflow cookie tunnel in. Race condition bin eaten by a grue do blob snarf finally endif fatal Leslie Lamport sudo James T. Kirk bit ip L0phtCrack script kiddies data chown. Starcraft baz dereference afk headers while boolean deadlock continue interpreter segfault back door break.",
      "author" : "Snake Pliskin"
    },
    "2" : {
      "title" : "Modem expoits",
      "body" : "Char class back door python endif firewall foo access pwned foad piggyback data chown bit it's a feature highjack man pages rm -rf snarf ssh leet client. Trojan horse break then throw emacs null protocol gurfle socket. Boolean blob injection Starcraft segfault worm sudo January 1, 1970 hello world I'm compiling else do sql gnu gobble race condition.",
      "author" : "M1nd M3ld"
    }
  }
}
